sex(Алёна_Лебеденко, F).
sex(Вячеслав_Лебеденко, M).
sex(Марина_Черникова, F).
sex(Николай_Лебеденко, M).
sex(Галина_M Лебеденко, F).
sex(Анатолий_Черников, M).
sex(Анна_Черникова, F).
sex(Михаил_Лебеденко, M).
sex(Никита_Мычак, M).
sex(Мария_Мычак, F).
sex(Алексей_Мычак, M).
parent(Вячеслав_Лебеденко, Алёна_Лебеденко).
parent(Марина_Черникова, Алёна_Лебеденко).
parent(Николай_Лебеденко, Вячеслав_Лебеденко).
parent(Галина_M Лебеденко, Вячеслав_Лебеденко).
parent(Анатолий_Черников, Анна_Черникова).
parent(Марина_Черникова, Анна_Черникова).
parent(Галина_M Лебеденко, Никита_Мычак).
parent(Анна_Черникова, Никита_Мычак).
